{
  "id": "b7250a6a-cf97-4f92-b58d-1514b5b22c67",
  "title": "🇺🇸 Trump Intel — Feb 22, 2026, 6:10 PM",
  "content": "# 🇺🇸 Trump Intel — Sunday, Feb 22, 2026, 6:10 PM EST\n\n## 🔴 CRITICAL ALERTS\n\nTRUMP|🔴|military|Iran Could \"Activate\" Hezbollah if US Strikes Regime|Trump weighs military strikes on Iran within deadline as IRGC tightens control of Hezbollah. Expert warns: \"If regime feels threatened, likelihood of unleashing Hezbollah against Israel and US assets increases substantially.\" US military buildup continues in Middle East with carrier strike groups and combat planes.|https://www.foxnews.com/world/iran-tightens-hezbollah-grip-trump-weighs-military-strikes-within-deadline\n\nTRUMP|🔴|trade|Supreme Court Strikes Down Trump's Emergency Tariffs 6-3|Major constitutional ruling blocks Trump's IEEPA tariffs. Chief Justice Roberts: \"Two words cannot bear such weight.\" Trump exceeded presidential power. $134 billion in collected tariffs now in question - businesses may be owed refunds. Roberts joined by Gorsuch, Barrett (Trump appointees).|https://www.scotusblog.com/2026/02/supreme-court-strikes-down-tariffs/\n\nTRUMP|🔴|trade|Trump Raises Global Tariffs to 15% After SCOTUS Defeat|Trump announces 15% global tariff (up from 10%) using Section 122 authority after Supreme Court struck down his emergency tariffs. Temporary 150-day tariffs start Tuesday. Treasury to issue refunds question left to lower courts. India delays trade talks.|https://www.pbs.org/newshour/economy/president-trump-increases-global-tariffs-to-15-after-supreme-court-decision\n\nTRUMP|🔴|military|Armed Man Shot Dead at Mar-a-Lago Perimeter|Austin Tucker Martin, 21, shot and killed by Secret Service after entering secure perimeter with shotgun and fuel canister around 1:30 AM Sunday. Trump was at White House. Second armed incident at Trump property in 6 months. FBI investigating motive.|https://www.nytimes.com/live/2026/02/22/us/trump-news\n\n## 🟠 IMPORTANT\n\nTRUMP|🟠|trade|India Delays US Trade Talks After Supreme Court Tariff Ruling|India postponed trade delegation to Washington due to uncertainty after SCOTUS struck down Trump tariffs. Interim deal framework had India buying $500B in US goods, tariffs cut from 25% to 18%. No new date set.|https://www.reuters.com/world/india/india-delays-us-trade-talks-after-supreme-court-rejects-trump-tariffs-source-2026-02-22/\n\nTRUMP|🟠|trade|Trump Admin Launches New Tariff Investigations|US Trade Rep Jamieson Greer announces Section 301 investigations into Brazil, China, and countries producing more than they consume. Commerce Dept launching Section 232 probes (steel/aluminum model). Rice imports under investigation for unfair trade practices.|https://www.cnn.com/us/live-news/trump-administration-tariffs-iran-news-02-22-26\n\nTRUMP|🟠|policy|Trump Attacks SCOTUS Justices in \"Remarkably Personal Terms\"|Trump called SCOTUS ruling \"an embarrassment to their families,\" targeting Gorsuch and Barrett (his own appointees). Praised Kavanaugh as \"new hero\" for 63-page dissent. Declared dissenting justices \"want to MAKE AMERICA GREAT AGAIN!\" Unprecedented attack on judiciary.|https://www.reuters.com/world/us/\n\nTRUMP|🟠|policy|Greenland PM Rejects Trump Hospital Ship, Calls Posts \"Random\"|PM Jens-Frederik Nielsen rebuffs Trump's proposal: \"We say no thank you. We have public healthcare where treatment is free.\" Urged Trump to \"talk to us instead of making random outbursts on social media.\" Trump had claimed Greenlanders \"not being taken care of.\"|https://www.foxnews.com/politics/greenland-rejects-trumps-hospital-ship-proposal-citing-existing-free-healthcare-system\n\nTRUMP|🟠|military|US-Iran Talks Scheduled Thursday in Geneva|Iranian FM Abbas Araghchi confirms more discussions with US envoy Steve Witkoff likely Thursday. Says \"good chance for diplomatic solution\" on nuclear program. Warns if US strikes Iran, Tehran would hit US bases in region. Trump's deadline for Iran deal expires this week.|https://www.cnn.com/us/live-news/trump-administration-tariffs-iran-news-02-22-26\n\n## 🟡 NOTABLE\n\nTRUMP|🟡|social|Trump Threatens Netflix: Remove Susan Rice or \"Pay the Consequences\"|Trump warns streaming giant to drop Obama/Biden official Susan Rice from board or face unspecified \"consequences\" as DOJ reviews Netflix's Warner Bros Discovery merger. Called Rice \"racist\" and \"Trump Deranged.\" Paramount mounting hostile takeover bid.|https://www.cnn.com/us/live-news/trump-administration-tariffs-iran-news-02-22-26\n\nTRUMP|🟡|policy|DHS Suspends TSA PreCheck & Global Entry, Then Reverses PreCheck|Homeland Security Secretary Kristi Noem announced suspension of trusted-traveler programs amid partial shutdown, then TSA walked back PreCheck suspension hours later. Democrats accuse DHS of \"punishing travelers\" and \"ruining your travel on purpose.\" Global Entry status unclear.|https://www.cnn.com/2026/02/22/politics/shutdonw-tsa-precheck-global-entry-suspended-hnk\n\nTRUMP|🟡|market|Treasury Secretary Bessent Defers on Tariff Refunds to Courts|Scott Bessent declined to speculate on $134 billion in tariff refunds, saying \"it is not up to me\" and deferring to lower courts. Trump administration previously acknowledged may have to return revenue. Thousands of businesses won hard-fought SCOTUS victory.|https://www.cnn.com/us/live-news/trump-administration-tariffs-iran-news-02-22-26\n\n## 🔵 INFO\n\nTRUMP|🔵|market|Trump Trade War: EU Delays Vote, UK Seeks \"Best Possible Deal\"|European Parliament delays trade vote amid Trump's tariff chaos. UK in talks over British firms' exposure to 15% global tariff. Asian economies weighing impact. CNN reports business confusion and traveler chaos dominating Sunday news cycle.|https://www.cnn.com/us/live-news/trump-administration-tariffs-iran-news-02-22-26\n\nTRUMP|🔵|social|Trump Posts No Public Appearances Sunday, Congratulates Hockey Team|President has no scheduled public events. Posted social media messages congratulating US men's hockey team for Olympic gold medal. Spending weekend at White House. Hosted Governors Dinner Saturday night.|https://www.nytimes.com/live/2026/02/22/us/trump-news\n\n---\n\n## SUMMARY\n\n**Top Market Movers:**\n1. **SCOTUS tariff defeat + immediate 15% hike** = extreme volatility, constitutional crisis vibes\n2. **Iran military strike window closing** = oil/defense sector alert, carrier groups deploying\n3. **$134B tariff refund question** = potential corporate windfalls vs. Treasury budget hole\n4. **India trade deal on ice** = Asian supply chain uncertainty\n5. **Armed intrusion at Mar-a-Lago** = security/stability concerns\n\n**Key Themes:**\n- Constitutional showdown: Trump vs. his own SCOTUS appointees\n- Trade war escalation despite judicial defeat\n- Iran military deadline approaching (10-15 days from last week)\n- Mexico cartel win (\"El Mencho\" killed) amid Trump pressure\n- Government shutdown chaos (DHS/TSA flip-flop)\n\n**Markets Watch:**\n- Defense stocks (LMT, RTX, NOC) — Iran tensions\n- Import-heavy retailers (TGT, WMT, COST) — 15% tariffs\n- Shipping/logistics (FDX, UPS) — tariff uncertainty\n- Oil (XLE, OXY) — Middle East war risk\n- Treasury bonds — refund obligations\n\n**Next 48 Hours:**\n- Tuesday: Trump's State of the Union + 15% tariffs take effect\n- Thursday: US-Iran talks in Geneva (last chance diplomacy?)\n- Ongoing: Lower courts to decide tariff refund lawsuits\n",
  "folder": "cron:trump-intel",
  "created_at": "2026-02-22T23:12:02.000Z"
}
