{
  "id": "f584804f-40c9-4331-95b7-ae3d293e76c5",
  "title": "🎬 Batch 2 — TikTok/Reels Scripts (11-20)",
  "content": "# Stratify TikTok/Reels Scripts — Batch 2\n\n### Format: Vertical 9:16 | Length: 20-30 seconds each\n### Avatar: Atlas AI / HeyGen Avatar\n### Goal: Curiosity hooks → drive clicks to stratify.associates\n\n---\n\n## Script 11: \"The 3-Second Strategy\"\n\n**Hook:** \"What if I told you I can build a trading strategy in 3 seconds that most traders spend weeks creating?\"\n\n**Body:** \"Watch this. Momentum play on NVDA. Buy when price breaks above the 20-day high with rising volume. Sell at 3% profit or 1.5% stop loss. Done. Strategy built. Backtested. Ready to deploy. That took 3 seconds. Your move.\"\n\n**CTA:** \"Try it yourself — @Stratify_hq — link in bio.\"\n\n---\n\n## Script 12: \"You're Trading Blind\"\n\n**Hook:** \"If you're trading without this, you're literally gambling.\"\n\n**Body:** \"Every trade you make should be backtested first. That means testing your idea against months of real market data BEFORE you risk a single dollar. Would you bet your savings on a coin flip? Then why are you trading strategies you've never tested? Stratify backtests your strategy in seconds — for free.\"\n\n**CTA:** \"Stop gambling. Start testing. @Stratify_hq — link in bio.\"\n\n---\n\n## Script 13: \"The $100K Secret\"\n\n**Hook:** \"I'm giving everyone who signs up $100,000. No, seriously.\"\n\n**Body:** \"When you create a Stratify account, you get $100K in paper trading money. Real market data. Real price action. Fake risk. You can test every strategy, make every mistake, and learn every lesson — without losing a cent. This is how professional traders are made. Not in a classroom. In the market. Risk-free.\"\n\n**CTA:** \"Get your $100K — @Stratify_hq — link in bio.\"\n\n---\n\n## Script 14: \"Wall Street's Dirty Secret\"\n\n**Hook:** \"Wall Street doesn't want you to know this.\"\n\n**Body:** \"The same algorithms hedge funds use to make millions? They're not magic. They're just rules. Buy when RSI drops below 30. Sell when MACD crosses bearish. Set a stop loss. Take profits. That's it. The only difference between you and a hedge fund is — they automated it. Now you can too. For free.\"\n\n**CTA:** \"Level the playing field — @Stratify_hq — link in bio.\"\n\n---\n\n## Script 15: \"I Lost $12,000 So You Don't Have To\"\n\n**Hook:** \"I lost $12,000 in one week trading with my gut. Here's what I learned.\"\n\n**Body:** \"Emotions are the enemy. I was up $4K on Monday. Got greedy. Held through Tuesday. Wednesday the market tanked. I panic sold Thursday at the bottom. Friday it recovered — without me. If I had a system — rules that don't feel fear, don't feel greed, don't feel anything — I'd still have that $12K. That's why I built Stratify.\"\n\n**CTA:** \"Don't trade with your gut. @Stratify_hq — link in bio.\"\n\n---\n\n## Script 16: \"The 2-Minute Portfolio\"\n\n**Hook:** \"I built an entire trading portfolio in under 2 minutes. Here's how.\"\n\n**Body:** \"Step 1 — Open Stratify. Step 2 — Pick a strategy template. Momentum, RSI, MACD, whatever fits your style. Step 3 — Set your risk level. Step 4 — Hit deploy. Your AI-generated strategy is now running on paper money, tracking real market data, 24/7. No spreadsheets. No YouTube courses. No guessing.\"\n\n**CTA:** \"Build yours in 2 minutes — @Stratify_hq — link in bio.\"\n\n---\n\n## Script 17: \"Why 90% of Traders Quit\"\n\n**Hook:** \"90% of traders quit within the first year. Here's the real reason nobody talks about.\"\n\n**Body:** \"It's not because the market is rigged. It's not because they're dumb. It's because they have no system. They buy based on a tweet. Sell based on a feeling. Then blame the market when it doesn't work. The 10% who survive? They all have one thing in common — a tested, repeatable strategy. That's literally what Stratify builds for you.\"\n\n**CTA:** \"Be the 10%. @Stratify_hq — link in bio.\"\n\n---\n\n## Script 18: \"Your Phone Is a Trading Terminal\"\n\n**Hook:** \"Your phone is more powerful than a 1990s Wall Street trading desk. You're just not using it right.\"\n\n**Body:** \"In 1995, traders paid $50,000 a year for real-time data, charting software, and algo execution. Today? Stratify gives you all of that. On your phone. For free. Real-time data. AI strategy builder. Backtesting. Paper trading. The tools exist. The question is — are you going to use them or keep scrolling?\"\n\n**CTA:** \"Turn your phone into a trading terminal — @Stratify_hq — link in bio.\"\n\n---\n\n## Script 19: \"The AI That Never Sleeps\"\n\n**Hook:** \"I built an AI that watches the market so I don't have to.\"\n\n**Body:** \"It scans for momentum shifts. It tracks RSI on every stock in my watchlist. It spots MACD crossovers before they happen. And when it finds a setup? It alerts me instantly. While I'm at dinner. While I'm at the gym. While I'm sleeping. It never takes a break. It never gets emotional. It never misses a signal.\"\n\n**CTA:** \"Meet Atlas — @Stratify_hq — link in bio.\"\n\n---\n\n## Script 20: \"Free vs Pro Traders\"\n\n**Hook:** \"Free traders vs Pro traders — here's the difference in 20 seconds.\"\n\n**Body:** \"Free traders check Reddit for stock picks. Pro traders scan the entire market with algorithms. Free traders buy based on hype. Pro traders buy based on backtested signals. Free traders panic sell at the bottom. Pro traders have stop losses set before they enter. Free traders hope. Pro traders have a system. Which one are you?\"\n\n**CTA:** \"Become a Pro trader today — @Stratify_hq — link in bio.\"\n\n---\n\n## Posting Schedule — Week 3-4\n\n| Day | Script # | Content Type |\n|-----|----------|-------------|\n| Mon | 13 | Hook ($100K giveaway) |\n| Tue | 15 | Story (lost $12K) |\n| Wed | 17 | Education (why 90% quit) |\n| Thu | 14 | Hot take (Wall Street secret) |\n| Fri | 20 | Comparison (free vs pro) |\n| Sat | 11 | Product demo (3-sec strategy) |\n| Sun | 18 | Motivation (phone = terminal) |\n\n**Week 4:** Scripts 12, 16, 19 + start batch 3\n\n## X Post Templates\n\n### For each video, pair with one of these post formats:\n\n**Format A — Question hook:**\n[Question that creates curiosity]\nWatch this 👇\n@Stratify_hq stratify.associates\n#algotrading #trading #fintech #buildinpublic #stockmarket\n\n**Format B — Bold claim:**\n[Controversial or bold statement]\nHere's why 👇\nTry it free → stratify.associates\n#algotrading #ai #tradingstrategy #fintok #daytrading\n\n**Format C — Personal story:**\n[Vulnerable or relatable moment]\nThis changed everything 👇\n@Stratify_hq\n#buildinpublic #trading #fintech #stockmarket #algotrading\n\n## Hashtag Rotation\n\n**Always use:** #algotrading #buildinpublic #stratify\n\n**Rotate 3-4 from:** #trading #fintech #ai #stockmarket #daytrading #tradingstrategy #fintok #wallstreet #investing #options #passiveincome\n",
  "folder": "📹 Daily X Video Posts / Scripts",
  "created_at": "2026-02-15T12:42:00.000Z"
}